In [7]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [14]:
target=df.Survived
inputs=df.drop(['Survived'],axis='columns')
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [16]:
dummies=pd.get_dummies(df['Sex']).astype(int)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [19]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [20]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [23]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [24]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [25]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [26]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [27]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [28]:
len(X_train)

712

In [29]:
len(X_test)

179

In [30]:
len(inputs)

891

In [31]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [32]:
model.fit(X_train,y_train)

GaussianNB()

In [33]:
model.score(X_test,y_test)

0.7877094972067039

In [34]:
X_test[:10]

     Pclass        Age      Fare  female  male
457       1  29.699118   51.8625       1     0
628       3  26.000000    7.8958       0     1
721       3  17.000000    7.0542       0     1
119       3   2.000000   31.2750       1     0
390       1  36.000000  120.0000       0     1
266       3  16.000000   39.6875       0     1
269       1  35.000000  135.6333       1     0
819       3  10.000000   27.9000       0     1
503       3  37.000000    9.5875       1     0
166       1  29.699118   55.0000       1     0

In [35]:
y_test[:10]

457    1
628    0
721    0
119    0
390    1
266    0
269    1
819    0
503    0
166    1
Name: Survived, dtype: int64

In [36]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 1, 0, 1, 0, 1, 1], dtype=int64)

In [40]:
model.predict_proba(X_test[:10])

array([[4.95409777e-03, 9.95045902e-01],
       [9.89393073e-01, 1.06069272e-02],
       [9.86177363e-01, 1.38226367e-02],
       [1.77022862e-02, 9.82297714e-01],
       [1.41403745e-01, 8.58596255e-01],
       [9.81987402e-01, 1.80125983e-02],
       [2.41848613e-05, 9.99975815e-01],
       [9.80202312e-01, 1.97976884e-02],
       [6.00853479e-02, 9.39914652e-01],
       [4.49153484e-03, 9.95508465e-01]])